Incubator/Clones/Asana/ror/app/views/task_dependencies/index.html.slim

SELECT `tasks`.* FROM `tasks` INNER JOIN `task_dependencies` ON `tasks`.`id` = `task_dependencies`.`sup_task_id` WHERE `task_dependencies`.`sub_task_id` = 1
---
    /      /ToDo: maybe change it to simple_form collection
    /      = ef.collection_select :sub_task_id, Task.all, :id, :title, {include_blank: true}, {class: 'js-select2'}