Incubator/Clones/Asana/ror/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO `tasks` (`title`, `description`, `deadline`, `created_at`, `updated_at`) VALUES ('Practice Oral English', '1. Try to follow the dialogs in movies', '2018-04-04 03:00:00', '2018-04-04 03:00:59', '2018-04-04 03:00:59')

  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
UPDATE `tasks` SET `title` = 'Practice Spoken English', `updated_at` = '2018-04-04 03:19:13' WHERE `tasks`.`id` = 1