Incubator/Clones/Asana/ror/app/controllers/task_dependencies_controller.rb

    task = Task.find(params[:task_id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1